In [1]:
import pandas as pd
import numpy as np

# Data Operations

In [2]:
df = pd.DataFrame({
        "Bahubali" : [5,4,5,3,5,4,2,1],
        "Dangal" : [4,5,4,5,5,3,5,2],
    }, index = ('Akash','Ravi','Amit','Pooja','Jyoti','Ram','Shyam','Babu Rao'))

In [3]:
df

          Bahubali  Dangal
Akash            5       4
Ravi             4       5
Amit             5       4
Pooja            3       5
Jyoti            5       5
Ram              4       3
Shyam            2       5
Babu Rao         1       2

In [4]:
def movie_ratings(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    if rating == 2:
        return 'D'
    if rating == 1:
        return 'E'

In [5]:
movie_ratings(3)

'C'

In [6]:
df.applymap(movie_ratings)

         Bahubali Dangal
Akash           A      B
Ravi            B      A
Amit            A      B
Pooja           C      A
Jyoti           A      A
Ram             B      C
Shyam           D      A
Babu Rao        E      D

# Data Operations With Statistical Functions

In [7]:
test_scores = pd.DataFrame({
        "Maths" : [90,67,89,55,78],
        "Science" : [80,88,45,56,87]
    }, index = ('Akash','Ravi','Amit','Pooja','Jyoti'))

In [8]:
test_scores

       Maths  Science
Akash     90       80
Ravi      67       88
Amit      89       45
Pooja     55       56
Jyoti     78       87

In [9]:
test_scores.mean()

Maths      75.8
Science    71.2
dtype: float64

In [10]:
test_scores.Maths[2]

89

In [15]:
test_scores.median()

Maths      78.0
Science    80.0
dtype: float64

In [17]:
test_scores.sort_values('Maths')

       Maths  Science
Pooja     55       56
Ravi      67       88
Jyoti     78       87
Amit      89       45
Akash     90       80

In [20]:
test_scores.sort_values('Science')

       Maths  Science
Amit      89       45
Pooja     55       56
Akash     90       80
Jyoti     78       87
Ravi      67       88

# Data Operations Using GroupBy

In [21]:
playersData = pd.DataFrame({
        'FirstName':['Virat','Sachin','Rohit','MS','Ishant'],
        'LastName':['Kohli','Tendulkar','Sharma','Dhoni','Sharma']
    })

In [22]:
playersData

  FirstName   LastName
0     Virat      Kohli
1    Sachin  Tendulkar
2     Rohit     Sharma
3        MS      Dhoni
4    Ishant     Sharma

In [23]:
grpData = playersData.groupby('LastName')

In [31]:
print(grpData.groups)

{'Kohli': [0], 'Tendulkar': [1], 'Sharma': [2, 4], 'Dhoni': [3]}

In [36]:
grouped = grpData.get_group('Sharma')
grouped

  FirstName LastName
2     Rohit   Sharma
4    Ishant   Sharma